app/views/home/index.html.erb

		<ul class="menu simple">
			<li><a href="#">Author: <%= art.user.first_name%></a></li>
			<li><a href="#">Comments: <%= art.comments.count%></a></li>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT "sub_comments".* FROM "sub_comments" WHERE "sub_comments"."comment_id" = $1  [["comment_id", 1]]
SELECT COUNT(*) FROM "sub_comments" WHERE "sub_comments"."comment_id" = $1  [["comment_id", 1]]