app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @article = current_user.articles.new(article_params)

    respond_to do |format|
      if @article.save

UPDATE "articles" SET "title" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["title", "An article is a written work published in a print or electronic medium."], ["updated_at", "2016-04-01 04:28:57.655875"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @article.update(article_params)