app/controllers/comments_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("body", "article_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "qqqqqqqqqqqqqqqqqqqqqqq"], ["article_id", 1], ["created_at", "2016-04-01 05:46:06.027982"], ["updated_at", "2016-04-01 05:46:06.027982"]]
---
  def create
  	@article = Article.find(params[:article_id])
    @comment = @article.comments.create(commente_params)