app/controllers/home_controller.rb

SELECT "articles".* FROM "articles"  ORDER BY created_at DESC
---
  def index
  	@artlicles = Article.all.order("created_at DESC")