app/controllers/sub_comments_controller.rb

	def create
  	@comment = Comment.find(params[:comment_id])
    @sub_comment = @comment.sub_comments.create(sub_comment_params)
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "sub_comments" ("body", "user_id", "comment_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "hey"], ["user_id", 1], ["comment_id", 1], ["created_at", "2016-04-01 06:45:36.535956"], ["updated_at", "2016-04-01 06:45:36.535956"]]

  def destroy
  	@comment = Comment.find(params[:comment_id])
    @sub_comment = @comment.sub_comments.find(params[:id])
    @sub_comment.destroy
---
SELECT  "sub_comments".* FROM "sub_comments" WHERE "sub_comments"."comment_id" = $1 AND "sub_comments"."id" = $2 LIMIT 1  [["comment_id", 1], ["id", 1]]
DELETE FROM "sub_comments" WHERE "sub_comments"."id" = $1  [["id", 1]]