app/controllers/sub_one_comments_controller.rb

  def create
  	@sub_comment = SubComment.find(params[:sub_comment_id])
    @sub_one_comment = @sub_comment.sub_one_comments.create(sub_one_comment_params)
---
SELECT  "sub_comments".* FROM "sub_comments" WHERE "sub_comments"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "sub_one_comments" ("body", "user_id", "sub_comment_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "sub sub comment"], ["user_id", 1], ["sub_comment_id", 2], ["created_at", "2016-04-01 09:27:14.239835"], ["updated_at", "2016-04-01 09:27:14.239835"]]

  def destroy
  	@sub_comment = SubComment.find(params[:sub_comment_id])
    @sub_one_comment = @sub_comment.sub_one_comments.find(params[:id])
    @sub_one_comment.destroy
---
SELECT  "sub_comments".* FROM "sub_comments" WHERE "sub_comments"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "sub_one_comments".* FROM "sub_one_comments" WHERE "sub_one_comments"."sub_comment_id" = $1 AND "sub_one_comments"."id" = $2 LIMIT 1  [["sub_comment_id", 2], ["id", 1]]
DELETE FROM "sub_one_comments" WHERE "sub_one_comments"."id" = $1  [["id", 1]]